---
kind: method
id: M:Autodesk.Revit.DB.ContourSetting.GetContourSettingItems
source: html/874b2349-0eff-2a17-cb9f-ca8be43c14b2.htm
---
# Autodesk.Revit.DB.ContourSetting.GetContourSettingItems Method

Get all contour setting items.

## Syntax (C#)
```csharp
public IList<ContourSettingItem> GetContourSettingItems()
```

## Returns
An array of contour setting items.